<!-- dflook/terraform-github-actions {"workspace":"link-var-files","backend_type":"remote","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"7bcfa6cdeac03f74e6f0b1b550681cc864c8c59a9ecdaddcd104cf03721432d3","plan_job_ref":"Job Test actions using target and replace #508 at https://github.com/dflook/terraform-github-actions/actions/runs/15362625723","plan_hash":"3d3be190eef468903d7f87e584330081fc6f5b8438bf879095da9d2c27f4adc0","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__ in the __link-var-files__ workspace
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
!~  count   = "Ud1uukdo3c" -> (known after apply)
!~  foreach = "GGljHHPQYF" -> (known after apply)
```
</details>

:memo: Plan generated in [Test actions using target and replace #508](https://github.com/dflook/terraform-github-actions/actions/runs/15362625723)